
## Plan Result (aat)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.s2s


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.s2s will be created
  + resource "azurerm_key_vault_secret" "s2s" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-rtl-export-aat/providers/Microsoft.KeyVault/vaults/civil-rtl-export-aat"
      + name                    = "civil-rtl-export-service-s2s-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":164,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->